[
  {
    "image": "https://logo.clearbit.com/chat.openai.com?size=512",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 5001,
    "description": "ChatGPT by OpenAI is one of the most advanced AI-powered conversational platforms in the world. Designed to understand and generate human-like text, it enables natural conversations on virtually any topic—from programming and creative writing to technical problem-solving and learning assistance. The app integrates seamlessly with OpenAI’s GPT-4 model, providing accurate, context-aware, and creative responses in real time. Users can draft essays, generate emails, write and debug code, summarize documents, or even brainstorm ideas with ease. ChatGPT is not just a chatbot; it’s an intelligent companion that adapts to your tone, learns from your interactions, and refines its answers for clarity and depth. The interface emphasizes simplicity and productivity, offering a minimalistic chat environment with support for history, pinned conversations, and syncing across devices. Regular updates bring improved reasoning, enhanced factual accuracy, and extended context length. It’s used by professionals, students, developers, and creators worldwide to amplify productivity, creativity, and understanding. Whether you're drafting marketing copy, learning a new concept, or just having a deep philosophical discussion, ChatGPT provides an unmatched, human-like AI experience — safely and responsibly.",
    "size": 120,
    "reviews": 4200000,
    "ratingAvg": 4.8,
    "downloads": 52000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 420000 },
      { "name": "5 star", "count": 4100000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/tiktok.com?size=512",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 5002,
    "description": "TikTok by ByteDance has transformed the digital entertainment landscape into a vibrant hub of short-form creativity. With over a billion active users globally, TikTok empowers anyone to become a creator—sharing authentic, engaging, and often viral videos that range from dance challenges to comedy, tutorials, and educational clips. The app’s intelligent algorithm curates personalized feeds based on your preferences and viewing habits, making content discovery seamless and addictive. TikTok’s editing tools are industry-leading, allowing creators to layer sounds, filters, transitions, captions, and effects with professional quality. Users can engage with the global community through duets, stitches, live streaming, and trending hashtags that drive cultural moments across the internet. Beyond entertainment, TikTok is increasingly used for micro-learning, brand promotion, and social awareness campaigns. Frequent updates bring new creative tools, better moderation policies, and performance optimizations. Whether you're a casual viewer, aspiring influencer, or business marketer, TikTok offers an immersive creative platform that blends innovation, entertainment, and expression into every scroll.",
    "size": 110,
    "reviews": 35000000,
    "ratingAvg": 4.4,
    "downloads": 37000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 6500000 },
      { "name": "5 star", "count": 27500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/instagram.com?size=512",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 5003,
    "description": "Instagram is the world’s leading platform for photo, video, and story sharing — empowering over a billion users to connect through creativity. From everyday moments to global movements, Instagram provides a canvas for self-expression. Users can share photos, Reels, and Stories, go live, and explore content through personalized feeds powered by AI recommendations. Advanced editing tools, filters, and music integration make every post stand out. Businesses and creators thrive through Instagram Shopping, Insights, and Reels monetization — connecting audiences and brands worldwide. With integrated messaging, collaboration tools, and safety controls, Instagram continues to redefine how the world visualizes connection and community.",
    "size": 125,
    "reviews": 45000000,
    "ratingAvg": 4.5,
    "downloads": 36000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1600000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 33400000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/whatsapp.com?size=512",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 5004,
    "description": "WhatsApp Messenger is a fast, secure, and reliable communication app used by over 2 billion people in more than 180 countries. It provides free messaging and calling via the internet — connecting family, friends, and businesses instantly. Messages, calls, photos, videos, and documents are protected with end-to-end encryption, ensuring privacy. Users can form group chats, share status updates, and even make video calls across devices. WhatsApp Business allows entrepreneurs to showcase catalogs and engage with customers easily. Its lightweight design and seamless performance across mobile and desktop make WhatsApp the global standard for private and effortless communication.",
    "size": 90,
    "reviews": 50000000,
    "ratingAvg": 4.6,
    "downloads": 28000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 44350000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/facebook.com?size=512",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 5005,
    "description": "Facebook connects billions of people across the globe, allowing users to share their lives, build communities, and discover what matters most. From posts, photos, and videos to Reels and live streams, Facebook fosters real-time communication and creativity. Its Groups and Marketplace features make it easy to engage in interests and buy or sell items locally. Facebook Watch and Gaming bring entertainment to the forefront, while Events and Pages support businesses and creators. Robust privacy tools, customizable feeds, and AI-driven recommendations make Facebook both personal and expansive — a hub of digital social life for every generation.",
    "size": 140,
    "reviews": 38000000,
    "ratingAvg": 4.2,
    "downloads": 30000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 25500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org?size=512",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 5006,
    "description": "Telegram is a high-speed, cloud-based messaging platform that prioritizes privacy, freedom, and flexibility. Built for individuals, groups, and communities, it allows users to exchange text messages, voice notes, photos, videos, and files of any type without size restrictions. Telegram’s core principle revolves around security — all communications are encrypted, and users can create secret chats that self-destruct. Beyond simple chat, Telegram is a full ecosystem: channels for broadcasting to large audiences, bots for automation and customer support, polls, reactions, and threaded discussions for organized communication. Businesses use Telegram for outreach, while developers extend its capabilities using the Telegram Bot API and Telethon framework. Its lightweight design ensures speed even on low connections, and data syncs seamlessly across all your devices — mobile, tablet, and desktop. With constant updates introducing features like Stories, video messages, and media editing tools, Telegram stands out as one of the most complete communication apps in the world.",
    "size": 85,
    "reviews": 32000000,
    "ratingAvg": 4.5,
    "downloads": 19000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 28350000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/snapchat.com?size=512",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5007,
    "description": "Snapchat redefined digital communication with its ephemeral messaging model, enabling users to send Snaps that disappear after viewing. It’s more than a messaging platform — it’s a visual storytelling hub powered by creativity, privacy, and fun. The app includes photo and video capture with AR Lenses, filters, Bitmojis, and effects that bring imagination to life. Users engage through private chats, public stories, Snap Maps to track friends in real time, and Spotlight — a space for viral short-form content. Snapchat also offers premium content from publishers and creators, making it a mix between social media and entertainment. Focused on user safety, Snapchat uses privacy-by-design principles, meaning you always control who sees what. Its vibrant ecosystem of features, such as streaks, AR games, and discoverable experiences, fosters community while preserving spontaneity — making every interaction feel real and fleeting.",
    "size": 95,
    "reviews": 29000000,
    "ratingAvg": 4.3,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 24100000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com?size=512",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 5008,
    "description": "Spotify revolutionized music consumption by providing on-demand streaming to millions of songs, albums, and podcasts from artists worldwide. Users can explore new music tailored to their tastes through powerful AI-driven recommendations like Discover Weekly and Release Radar. The app enables playlist creation, sharing, and collaborative listening. Offline downloads let users enjoy tracks anywhere without a connection. Spotify’s advanced audio settings, such as crossfade, equalizer adjustments, and high-quality streaming, appeal to both casual listeners and audiophiles. Podcasts have also become a core feature, hosting creators ranging from independent voices to exclusive shows from celebrities. Spotify for Artists allows musicians to upload and analyze their streams in real time, giving insight into their audience demographics and song performance. Whether on mobile, desktop, or smart speakers, Spotify ensures a seamless experience — one focused on personal taste, exploration, and convenience.",
    "size": 100,
    "reviews": 27000000,
    "ratingAvg": 4.5,
    "downloads": 24000000,
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 23600000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/netflix.com?size=512",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 5009,
    "description": "Netflix is a leading global entertainment platform that offers movies, series, documentaries, and originals on demand. From Hollywood blockbusters to indie gems, Netflix curates content across every genre and region. With its proprietary recommendation engine, users receive personalized suggestions based on their watch history, making each experience unique. Subscribers can stream in resolutions up to 4K HDR, download for offline playback, and set up multiple user profiles under a single account. Parental controls ensure a family-safe experience, while smart adaptive streaming adjusts quality to your connection speed. Netflix also produces acclaimed originals such as Stranger Things, The Crown, and Money Heist, becoming a pioneer in digital filmmaking and storytelling. Behind the scenes, Netflix invests heavily in accessibility, localization, and performance — optimizing streaming even in low-bandwidth environments. Whether you’re binge-watching or exploring global cinema, Netflix brings the world’s entertainment to your fingertips.",
    "size": 150,
    "reviews": 22000000,
    "ratingAvg": 4.6,
    "downloads": 35000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 16700000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/disneyplus.com?size=512",
    "title": "Disney+",
    "companyName": "The Walt Disney Company",
    "id": 5010,
    "description": "Disney+ is the home of the world’s most beloved franchises — from Marvel and Star Wars to Pixar and National Geographic. It offers an ever-growing library of blockbuster movies, original series, and exclusive releases, available in stunning 4K Ultra HD. Subscribers can download unlimited titles, set up multiple profiles (including child-safe ones), and stream on any device, from smartphones to smart TVs. Its intuitive interface makes discovering content effortless — whether you’re revisiting classics like The Lion King or diving into new hits like The Mandalorian. Disney+ continues to expand globally, bringing localized experiences and language support. The app also emphasizes accessibility with subtitles, dubbing, and descriptive audio. Regular feature updates and strong integration with the broader Disney ecosystem make it a cornerstone of family entertainment in the digital age.",
    "size": 140,
    "reviews": 17000000,
    "ratingAvg": 4.4,
    "downloads": 25000000,
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 15800000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/amazon.com?size=512",
    "title": "Amazon Shopping",
    "companyName": "Amazon",
    "id": 5011,
    "description": "Amazon Shopping offers a complete e-commerce experience on your mobile device, allowing you to browse millions of items across categories like electronics, fashion, groceries, books, and home essentials. With secure one-click purchasing, detailed reviews, real-time shipment tracking, and personalized recommendations, it’s designed for maximum convenience. Users can scan barcodes to find products instantly, use Alexa for voice search, and explore daily deals and Lightning Offers. Amazon’s strong logistics backbone ensures fast, reliable delivery worldwide. Prime members enjoy free shipping, exclusive discounts, and access to Prime Video and Prime Music. The app continuously improves usability with smoother navigation, regional pricing, and multi-language support. Whether you’re a casual shopper or a small business seller, Amazon Shopping redefines digital retail efficiency.",
    "size": 160,
    "reviews": 21000000,
    "ratingAvg": 4.3,
    "downloads": 40000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 15700000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/uber.com?size=512",
    "title": "Uber",
    "companyName": "Uber Technologies",
    "id": 5012,
    "description": "Uber connects riders with drivers in over 10,000 cities globally. Request a ride in seconds, view fare estimates upfront, and track your driver in real time. Beyond rides, Uber offers delivery services (Uber Eats), rentals, and public transport integration in select cities. Safety is at its core — every trip is tracked by GPS, driver identities are verified, and emergency support is built into the app. Riders can share trip details, rate drivers, and enjoy flexible payment methods including cards, cash, and digital wallets. For drivers, Uber provides income opportunities with real-time navigation, earning insights, and safety controls. The app continues to evolve with innovations like EV support, carpooling, and accessibility features. Whether commuting, traveling, or exploring new places, Uber simplifies mobility with trust and technology.",
    "size": 95,
    "reviews": 19000000,
    "ratingAvg": 4.2,
    "downloads": 30000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 18200000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/waze.com?size=512",
    "title": "Waze",
    "companyName": "Google LLC",
    "id": 5013,
    "description": "Waze is a community-driven GPS navigation app that provides real-time traffic and route information. It helps drivers save time, avoid traffic jams, and discover alternate routes using data shared by millions of users globally. The app notifies users of road closures, speed traps, police presence, and construction zones. Voice-guided directions, ETA sharing, and customizable vehicle icons make driving more personal and interactive. Waze integrates with music apps like Spotify and supports Android Auto and CarPlay for seamless connectivity. Its map data updates daily, powered by user reports and local map editors. For frequent drivers, Waze is more than navigation — it’s a connected driving experience combining efficiency, safety, and fun.",
    "size": 90,
    "reviews": 8000000,
    "ratingAvg": 4.4,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 6200000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/strava.com?size=512",
    "title": "Strava",
    "companyName": "Strava, Inc.",
    "id": 5014,
    "description": "Strava is a performance-tracking and social fitness app for runners, cyclists, swimmers, and outdoor enthusiasts. It uses GPS to record routes, track performance metrics, and analyze progress over time. Athletes can set goals, compare segment times, and compete on leaderboards. Integration with wearables (Garmin, Apple Watch, Fitbit) ensures precise data collection. Strava’s social element allows sharing achievements, joining clubs, and participating in global challenges. Premium users unlock in-depth analytics, route planning, and training insights. The app fosters motivation through community engagement — transforming workouts into shared experiences. Its clean design and continuous updates make Strava essential for both casual exercisers and professional athletes.",
    "size": 120,
    "reviews": 10000000,
    "ratingAvg": 4.5,
    "downloads": 25000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1400000 },
      { "name": "5 star", "count": 8400000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/canva.com?size=512",
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "id": 5015,
    "description": "Canva empowers anyone to design professional-quality visuals — from social media graphics and presentations to posters, logos, and videos — with no design experience required. Its drag-and-drop editor, vast template library, and built-in stock images simplify creativity. Users can collaborate in real time, comment on designs, and export in multiple formats. Canva Pro introduces advanced features like background removal, brand kits, and content scheduling. Its mobile app extends full creative functionality on the go. Whether you’re a marketer, teacher, or freelancer, Canva makes stunning design accessible to everyone.",
    "size": 150,
    "reviews": 12000000,
    "ratingAvg": 4.6,
    "downloads": 30000000,
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 10200000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/pandora.com?size=512",
    "title": "Pandora",
    "companyName": "Pandora Media, LLC",
    "id": 5016,
    "description": "Pandora lets you listen to personalized internet radio stations, playlists, and new music discovery. Use features like thumbs up/down, curated stations, and offline listening. It adapts to your musical taste and moods. Pandora is a personalized music streaming service that curates songs based on your tastes and listening habits. It combines powerful recommendation algorithms with handcrafted radio-style stations. Users can create custom playlists, discover new artists, and enjoy ad-free listening with Pandora Plus or Premium. Offline playback, high-quality audio, and cross-device syncing enhance the experience. Pandora’s “Modes” let users fine-tune their stations — from discovering fresh releases to deep cuts from favorite artists. As one of the pioneers in streaming, Pandora remains a top choice for those who want their music to evolve with them.",
    "size": 90,
    "reviews": 7000000,
    "ratingAvg": 4.2,
    "downloads": 12000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 6700000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/walmart.com?size=512",
    "title": "Walmart",
    "companyName": "Walmart Inc.",
    "id": 5017,
    "description": "Walmart app helps you browse products, order groceries, select curbside pickup or delivery, track orders, and manage your account. Get deals, scan barcodes in store, and save items for later. App aims for ease-of-use and fast performance even under busy traffic periods. Walmart’s official app brings the world’s largest retailer directly to your pocket. Shop millions of items — from groceries and electronics to home essentials and fashion — all in one place. With pickup and delivery options, users can schedule convenient shopping times or get same-day doorstep delivery. The app includes easy reordering, barcode scanning, and in-store navigation to find products fast. Walmart Pay simplifies checkout with secure digital payments. Weekly savings, Rollbacks, and personalized deals help customers save more. Walmart’s seamless integration of online and in-store shopping provides a smart, affordable, and effortless retail experience.",
    "size": 180,
    "reviews": 9500000,
    "ratingAvg": 4.3,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 7600000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/linkedin.com?size=512",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 5018,
    "description": "LinkedIn is the world’s largest professional networking platform, connecting over 900 million professionals globally. It enables users to build career profiles, showcase skills, and grow their professional reputation. Employers use LinkedIn to recruit talent, while job seekers discover opportunities tailored to their experience. Features include career insights, learning modules, newsletters, and community discussions. LinkedIn Learning offers thousands of expert-led courses in business, design, and technology. As a social platform for work, LinkedIn fosters meaningful connections, knowledge sharing, and professional growth.",
    "size": 130,
    "reviews": 12000000,
    "ratingAvg": 4.5,
    "downloads": 25000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/airbnb.com?size=512",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 5019,
    "description": "Airbnb helps you find unique places to stay and experiences anywhere in the world. Book houses, apartments, or rooms hosted by locals. Browse photos, reviews, pricing, and amenities. Hosts manage listings and guests easily via messaging and booking tools. Airbnb reimagines travel by connecting people with unique places to stay and authentic local experiences. From luxury villas and cozy cabins to city apartments and countryside cottages, Airbnb offers millions of listings across 190+ countries. Hosts can share their space safely using tools for pricing, booking management, and guest communication. Travelers benefit from transparent reviews, secure payments, and 24/7 support. Beyond stays, Airbnb Experiences lets users book tours, cooking classes, and adventures guided by locals. The app fosters trust and global community — making every journey personal, meaningful, and memorable.",
    "size": 100,
    "reviews": 14000000,
    "ratingAvg": 4.5,
    "downloads": 27000000,
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 11800000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/khanacademy.org?size=512",
    "title": "Khan Academy",
    "companyName": "Khan Academy",
    "id": 5020,
    "description": "Khan Academy provides free educational resources, courses, and practice exercises on a wide range of subjects. Watch instructional videos, track your learning progress, and test your understanding. It’s designed for students of all ages to learn flexibly and independently. Khan Academy is a free, world-class learning platform for students, teachers, and lifelong learners. It offers interactive lessons, practice exercises, and instructional videos across subjects like math, science, history, economics, and computer programming. Each course is self-paced and backed by mastery learning principles that adapt to a student’s progress. Teachers and parents can track performance with built-in analytics and progress reports. With partnerships worldwide, Khan Academy makes education accessible to anyone, anywhere — leveling the playing field for learners regardless of background. It’s not just an app; it’s a global movement for free, high-quality education.",
    "size": 80,
    "reviews": 6000000,
    "ratingAvg": 4.7,
    "downloads": 13000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 5600000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/coursera.org?size=512",
    "title": "Coursera",
    "companyName": "Coursera, Inc.",
    "id": 5021,
    "description": "Coursera partners with top universities and organizations to offer online courses, certificates, and degrees. Browse courses by topic, learn at your own pace, submit assignments, and share achievements. The app supports video lectures, quizzes, and peer reviews. Coursera partners with top universities and organizations — including Yale, Google, and Stanford — to deliver world-class education online. Users can enroll in thousands of courses, earn professional certificates, or pursue full degrees entirely online. Courses cover tech, business, design, data science, and personal development, combining video lectures, peer assessments, and interactive projects. Coursera Plus subscribers gain unlimited access to the platform’s premium catalog. Its mission is to democratize learning by empowering anyone to achieve career goals and personal growth through accessible, accredited education.",
    "size": 110,
    "reviews": 5000000,
    "ratingAvg": 4.5,
    "downloads": 12000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 5340000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/candycrushsaga.com?size=512",
    "title": "Candy Crush Saga",
    "companyName": "King",
    "id": 5022,
    "description": "Candy Crush Saga is a match-three puzzle game where players swap candies to match three or more of the same color. With hundreds of levels, daily challenges, and social sharing, it’s an addictive and visually appealing game. Use boosters, combos, and strategies to beat hard levels. Candy Crush Saga is one of the world’s most iconic puzzle games, loved for its bright visuals and addictive gameplay. Players match colorful candies in thousands of challenging levels, unlocking boosters, rewards, and new episodes as they progress. Daily challenges, timed events, and tournaments keep gameplay fresh and exciting. Syncing across devices ensures your progress is always saved. With millions of active players and frequent updates introducing new twists, Candy Crush Saga remains a timeless classic in casual gaming — fun, challenging, and irresistibly sweet.",
    "size": 125,
    "reviews": 25000000,
    "ratingAvg": 4.7,
    "downloads": 80000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 20500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com?size=512",
    "title": "Spotify for Artists",
    "companyName": "Spotify AB",
    "id": 5023,
    "description": "Spotify for Artists empowers musicians to manage their artist profile, view real-time listening data, and track audience growth. Musicians can upload new releases, customize their bios, and analyze which songs and playlists drive engagement around the world. Spotify is the world’s largest audio streaming service, giving users access to millions of songs, podcasts, and audiobooks. Its advanced AI recommendations tailor playlists like Discover Weekly and Daily Mixes to your taste. Users can create collaborative playlists, share music with friends, and explore exclusive artist content. Offline downloads and high-quality streaming ensure seamless listening anywhere. Podcasts, audiobooks, and live audio make Spotify a full-spectrum sound experience. Whether you’re working, studying, or relaxing, Spotify provides the perfect soundtrack for every moment.",
    "size": 80,
    "reviews": 2800000,
    "ratingAvg": 4.6,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 2280000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/paypal.com?size=512",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 5043,
    "description": "PayPal is one of the most trusted platforms for secure online payments, money transfers, and business transactions. The app supports peer-to-peer payments, currency conversions, and integrations with e-commerce platforms. With robust security, fraud protection, and instant notifications, PayPal simplifies global digital payments. PayPal is a global leader in online payments, trusted by over 400 million users worldwide. It enables secure money transfers, online shopping, and peer-to-peer payments with just an email or phone number. The app supports multiple currencies and integrates with top e-commerce platforms. PayPal’s Buyer Protection ensures peace of mind, while its in-app features let users manage invoices, subscriptions, and cryptocurrencies. For businesses, PayPal offers tools for checkout, invoicing, and global transactions — all backed by industry-leading fraud protection. It’s fast, reliable, and essential for digital finance in the modern age.",
    "size": 110,
    "reviews": 40000000,
    "ratingAvg": 4.6,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 34200000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/notion.so?size=512",
    "title": "Notion",
    "companyName": "Notion Labs, Inc.",
    "id": 5024,
    "description": "Notion is an all-in-one workspace designed for organization, productivity, and collaboration. It combines notes, documents, databases, project management, and wikis in one flexible tool. Users can create custom dashboards, manage tasks with Kanban boards, and collaborate in real time. Notion’s powerful templates make it ideal for startups, students, and remote teams. Offline mode, markdown support, and integration with tools like Slack, GitHub, and Google Drive enhance workflow efficiency. Its minimal interface is highly customizable — from personal to-do lists to complex knowledge bases. Notion’s ecosystem also includes AI-powered assistance that summarizes notes and generates content automatically. It’s more than a note-taking app — it’s a digital operating system for your life and work.",
    "size": 90,
    "reviews": 8000000,
    "ratingAvg": 4.8,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 7300000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/slack.com?size=512",
    "title": "Slack",
    "companyName": "Slack Technologies, LLC",
    "id": 5025,
    "description": "Slack is a modern messaging platform built for teams. It centralizes communication, replacing scattered emails with organized channels for projects, departments, and collaborations. Users can share files, connect third-party apps, and automate workflows using bots and integrations. Threaded conversations keep discussions focused, while voice and video calls allow real-time collaboration. Slack’s search and archive features make retrieving information effortless, and its API supports custom extensions for enterprise needs. With features like Slack Connect, teams can communicate across organizations securely. Slack’s blend of usability, flexibility, and automation makes it a cornerstone of digital teamwork.",
    "size": 120,
    "reviews": 9500000,
    "ratingAvg": 4.4,
    "downloads": 22000000,
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 7550000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/asana.com?size=512",
    "title": "Asana",
    "companyName": "Asana, Inc.",
    "id": 5026,
    "description": "Asana is a powerful work management platform designed to help teams organize, track, and achieve goals efficiently. It allows users to create projects, assign tasks, set deadlines, and monitor progress in real time. Visual tools like timelines, Kanban boards, and workload charts provide transparency across teams. Asana integrates with hundreds of other services — including Slack, Zoom, and Google Workspace — to streamline workflows. The app enhances productivity by eliminating email clutter and aligning teams under clear objectives.  With automation features, recurring tasks, and reporting dashboards, Asana empowers businesses to scale with structure. Whether managing a small team or coordinating global operations, Asana turns chaos into clarity.",
    "size": 95,
    "reviews": 3500000,
    "ratingAvg": 4.6,
    "downloads": 7000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 3000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/figma.com?size=512",
    "title": "Figma",
    "companyName": "Figma, Inc.",
    "id": 5027,
    "description": "Figma is a collaborative design tool for teams to create user interfaces and prototypes together in real time. With version history, design systems, and live multiplayer editing, it’s a must-have for modern UI/UX designers and developers. Figma is a collaborative interface design tool that revolutionized how teams create digital products. It allows real-time co-editing, prototyping, and feedback — all within a browser. Designers, developers, and marketers can collaborate simultaneously on UI/UX projects with built-in version control. Plugins, templates, and community resources make Figma powerful and extensible. With Figma Mirror and mobile support, teams can preview designs instantly on any device. Its blend of speed, collaboration, and simplicity has made Figma the gold standard for modern product design.",
    "size": 150,
    "reviews": 2200000,
    "ratingAvg": 4.7,
    "downloads": 5500000,
    "ratings": [
      { "name": "1 star", "count": 12000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1840000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org?size=512",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 5028,
    "description": "Telegram offers fast, secure messaging with cloud storage, channels, bots, and large group support. Its privacy-focused approach includes secret chats, self-destructing messages, and no data sharing with third parties. Telegram is a privacy-focused messaging app offering fast, secure communication for millions worldwide. It supports cloud-based chat syncing, large file sharing (up to 2GB), and channels for unlimited audiences. End-to-end encryption, secret chats, and two-factor authentication safeguard privacy.  Telegram’s open API encourages developers to build bots, tools, and integrations that extend functionality. From casual texting to global community management, Telegram offers unmatched speed, reliability, and control — all wrapped in a clean, modern design.",
    "size": 105,
    "reviews": 27000000,
    "ratingAvg": 4.7,
    "downloads": 65000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 21100000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/discord.com?size=512",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 5029,
    "description": "Discord brings communities together with voice, video, and text chat. Originally for gamers, it now powers study groups, creators, and professional communities. Create servers, manage channels, stream, and use bots for automation and moderation. Discord started as a voice chat app for gamers but has evolved into a universal platform for communities, creators, and teams. Users can join servers, chat via text, voice, or video, and stream media in real time. With roles, bots, and channels, Discord supports flexible organization for groups of any size. Its Nitro subscription unlocks HD streaming, custom emojis, and more personalization. Whether for gaming, study groups, or global fandoms, Discord provides a vibrant space for people to connect, create, and collaborate effortlessly.",
    "size": 140,
    "reviews": 38000000,
    "ratingAvg": 4.6,
    "downloads": 80000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 30900000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/trello.com?size=512",
    "title": "Trello",
    "companyName": "Atlassian Corporation Plc",
    "id": 5030,
    "description": "Trello simplifies project management with boards, lists, and cards. Organize your tasks visually, collaborate with teammates, and track progress across projects. It integrates with Slack, Jira, and Google Drive for a complete workflow solution. Trello is a visual project management tool that organizes tasks using boards, lists, and cards. Teams and individuals use Trello to plan workflows, track progress, and collaborate on projects of any scale. Cards can include checklists, attachments, due dates, and comments, keeping everyone aligned. Integrations with Slack, Google Drive, and Jira make Trello adaptable for all industries. Automation with Butler streamlines repetitive work, saving time and boosting productivity. Simple yet powerful, Trello turns task management into an intuitive, enjoyable experience.",
    "size": 85,
    "reviews": 4500000,
    "ratingAvg": 4.5,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 3900000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/duolingo.com?size=512",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "id": 5031,
    "description": "Duolingo is the world’s most popular language-learning app, blending gamification with high-quality education. Its lessons are short, interactive, and fun — designed to help users build real-world language skills step by step. The app supports over 40 languages, including Spanish, French, Japanese, Korean, and Arabic. Lessons adapt dynamically based on your progress, strengthening weaker areas through spaced repetition. Duolingo’s mascot, Duo the owl, keeps users motivated through daily streaks, rewards, and XP levels. Learners can practice reading, writing, listening, and speaking skills using speech recognition and contextual exercises. Beyond individuals, Duolingo for Schools enables educators to track student performance. The app also integrates cultural learning, ensuring students grasp nuances beyond vocabulary. With over half a billion downloads, Duolingo stands at the intersection of education, technology, and entertainment.",
    "size": 120,
    "reviews": 35000000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 30200000 }
    ]
  }
]
